#+title: 1. Two Sum
#+author: nshan651
#+startup: inlineimages

https://leetcode.com/problems/two-sum/

Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.

You may assume that each input would have exactly one solution, and you may not use the same element twice.

You can return the answer in any order.

* Examples
** Example 1:
#+begin_example
Input: nums = [2,7,11,15], target = 9
Output: [0,1]
Explanation: Because nums[0] + nums[1] == 9, we return [0, 1].#+end_example
#+end_example

** Example 2:
#+begin_example
Input: nums = [3,2,4], target = 6
Output: [1,2]
#+end_example

** Example 3:
#+begin_example
Input: nums = [3,3], target = 6
Output: [0,1]
#+end_example

* Constraints:
    - 2 <= nums.length <= 10^4
    - -10^9 <= nums[i] <= 10^9
    - -10^9 <= target <= 10^9
    - Only one valid answer exists.

* Follow up:
Can you come up with an algorithm that is less than O(n^2) time complexity?

* Solution

#+begin_src C++ :includes <iostream> :flags -I./src/util -std=c++20 :tangle "src/1-two-sum.cpp"
  #include <vector>
  #include <map>
  // using namespace std;
  class Solution {
  public:
      std::vector<int> twoSum(std::vector<int>& nums, int target) {
        std::map<int, int> prevStore;

        int i = 0;
        for (auto n : nums)
        {
          int diff = target - n;
          if (prevStore.contains(diff))
            return {prevStore[diff], i};
          prevStore[n] = i;
          i++;
        }
        return {};
      }
  };

  int main()
  {
    // [2,15,11,7,22,25], target = 9
    Solution s1;
    std::vector<int> nums = {2,15,11,7,22,25};
    int target = 9;
    auto res = s1.twoSum(nums, target);

    for (auto i : res)
      std::cout << i << "\n";

  }
#+end_src

#+RESULTS:
| 0 |
| 3 |

- [2,15,11,7,22,25], target = 9
